#ifndef __W25Q64_H__
#define __W25Q64_H__

#include "stm32f4xx.h"                  // Device header
#include "sys.h"
/****** 相关位段操作宏 ******/
#define W25Q64 PBout(2)		//用于片选

/*************************************************
函数名:void W25Q64_Init(void)
功能:初始化LED
参数:无
返回值:无
说明:
	W25Q64_CS ---- GPIOB 2片选引脚
	GPIOB挂载在RCC的AHB1总线
**************************************************/
void W25Q64_Init(void);

/************************************************
功能:扇区擦除(4k)  == 20h
*************************************************/
void W25Q64_Erasr(u32 addr);
	
/************************************************
函数:int W25Q64_Write_Data(u32 addr,u8 *data,u8 len)
功能:页编程 发送数据 = 02h 
参数:
	@addr：地址
	@data：要写入的数据
	@len：要写入的长度
返回:成功写入的数据长度
*************************************************/
int W25Q64_Write_Data(u32 addr,u8 *data,u8 len);
/******************************************************
函数:int W25Q64_Read_Data(u32 addr,u8 *data,u8 len)
功能:读数据 = 03h
参数:
	@addr：地址
	@data：读取后数据存放的地址
	@len：要读的长度
返回:成功读取的数据长度
*******************************************************/
int W25Q64_Read_Data(u32 addr,u8 *data,u8 len);
#endif

