#ifndef __DHT11_H__
#define __DHT11_H__

#include "stm32f4xx.h"                  // Device header
#include "sys.h"
/****** 相关位段操作宏 *****************************
由于单总线协议，我们需要进行接收和发送,需要改变模式
所以,我们指定几个宏，用于设置输出 | 输出 模式 
                    用于设置输出[高 | 低] 电平
					用于读取输入[高 | 低] 电平
***************************************************/
#define DHT11_Init_IN()  GPIOA->MODER &= ~(0x3 << 6)  //输入模式00
#define DHT11_Init_OUT() GPIOA->MODER |= (0x1 << 6)   //输出模式01

#define DHT11_OUT PAout(3)  //用于电平输出[高 | 低] 电平   ---- 主发,从收 ----
#define DHT11_IN  PAin(3)   //用于电平读取[高 | 低] 电平   ---- 主收,从发 ----

/*************************************************
函数名:void DHT11_Init(void)
功能:初始化DHT11温湿度模块
参数:无
返回值:无
说明:
	DHT11_DATA ---- GPIOA 3引脚
	GPIOA挂载在RCC的AHB1总线
**************************************************/
void DHT11_Init(void);
/*******************************************************************************************
函数名:int DHT11_Read_Data(u8 *HumiH,u8 *HumiL,u8 *TempH,u8 *TempL)
功能:DHT11 读取温度和湿度
参数:
	@HumiH:湿度高位
	@HumiL:湿度低位
	@TempH:温度高位
	@TempL:温度低位
返回值: 
	成功:0
	失败:-1	
	u8 HumiH,HumiL,TempH,TempL;
*******************************************************************************************/
int DHT11_Read_Data(u8 *HumiH,u8 *HumiL,u8 *TempH,u8 *TempL);
#endif

