#ifndef __DELAY_H__
#define __DELAY_H__

#include "stm32f4xx.h"                  // Device header
/**************************************************************
函数名:void delay_Init(u8 SYSCLK)
功能:滴答定时器初始化
参数:
	@SYSCLK：系统时钟频率,一般填写 168
返回值:无
说明:需要提前将时钟树外设时钟HSE_VALUE 和 PLL 倍频锁相环设置好
	1.使用8分频,计算1微秒所需要节拍次数 _us
***************************************************************/
void delay_Init(u8 SYSCLK);
/***************************************************************
函数名:void delay_us(u32 us)
功能:微秒级延时
参数:
	@us:微秒
返回值:无
注意:us不能超过 16777216 / _us
*****************************************************************/
void delay_us(u32 us);
/*************************************************
函数名:void delay_ms(uint32_t ms);
功能:毫秒级延时(滴答定时器精准的)
参数:
	@ms : 毫秒
返回值:无
说明:
**************************************************/
void delay_ms(uint32_t ms);

#endif

