#ifndef __IIC_H__
#define __IIC_H__

#include "stm32f4xx.h"                  // Device header
#include "sys.h"
/****** 相关位段操作宏 ******/
#define I2C_SCL PBout(6)	//时钟线输出
#define I2C_SDA PBout(7)    //数据线输出

#define READ_SDA PBin(7)    //数据线输入

#define I2C_IN()	GPIOB->MODER &= ~(0x3 << 14)		//设置数据线为输入模式00
#define I2C_OUT()	GPIOB->MODER |= (0x1 << 14)			//设置数据线为输出模式01

#define IIC_DELAY 2	//延时
/*************************************************
函数名:void IIC_Init(void)
功能:初始化IIC
参数:无
返回值:无
说明:
	数据线SCL -----> PB6
	数据线SDA -----> PB7
	GPIOB挂载在RCC的AHB1总线
**************************************************/
void IIC_Init(void);
/***************************************************
函数名:void IIC_Start(void)
功能:IIC起始信号
参数:
返回值:
说明:
	时钟线高电平期间,数据线由高变低
****************************************************/
void IIC_Start(void);

/***************************************************
函数名:void IIC_Stop(void)
功能:IIC终止信号
参数:
返回值:
说明:
	时钟线高电平期间,数据线由低变高
****************************************************/
void IIC_Stop(void);
/***************************************************
函数名:void IIC_Ack(void)
功能:IIC主机产生应答信号
参数:
返回值:
说明:
****************************************************/
void IIC_Ack(void);
/***************************************************
函数名:void IIC_NAck(void)
功能:IIC主机产生非应答信号
参数:
返回值:
说明:
****************************************************/
void IIC_NAck(void);
/***************************************************
函数名:int IIC_Wait_Ack(void)
功能:IIC主机等待从机应答
参数:
返回值:
	应答:0
	非应答:-1
****************************************************/
int IIC_Wait_Ack(void);
/*********************************************
函数名:void IIC_Send_Byte(u8 data)
功能:发送1字节数据
参数:
	@data：数据
*********************************************/
void IIC_Send_Byte(u8 data);
/*********************************************
函数名:u8 IIC_Read_Byte(void)
功能:读取1字节数据
参数:
返回值:数据
*********************************************/
u8 IIC_Read_Byte(void);
#endif

