#ifndef __SPI_H__
#define __SPI_H__

#include "stm32f4xx.h"                  // Device header
#include "sys.h"
/*************************************************
函数名:void SPI1_Init(void)
功能:初始化SPI总线
参数:无
返回值:无
说明:
	SCLK时钟线 ---- GPIOB 3引脚
	MISO接收线 ---- GPIOB 4引脚
	MOSI发送线 ---- GPIOB 5引脚
	
	GPIOB挂载在RCC的AHB1总线
**************************************************/
void SPI1_Init(void);
/*************************************************
函数:u8 SPI1_Write_Read(u8 data)
功能:发送 | 接收 1字节数据
参数:
	@data：要发送的数据,如果是接收可以填写0x00 | 0xFF

返回值:
	@读取的数据 , 如果是写入则忽略该返回值

说明: 发送和接收都是同步操作的
	1.发送数据时,可以忽略收到的消息
	2.接收数据时,发送一个空字节
**************************************************/
u8 SPI1_Write_Read(u8 data);
#endif

