#ifndef __LIGHT_H__
#define __LIGHT_H__

#include "stm32f4xx.h"                  // Device header
#include "sys.h"

/*************************************************
函数名:void Light_Init(void)
功能:初始化光敏电阻引脚为模拟
参数:无
返回值:无
说明:
	GPIOA 0
**************************************************/
void Light_Init(void);

/****************************************************
函数:u16 Light_Get(void)
功能:获取光照值并写转换％算法
返回值:数值范围
范围:0-100
数值:0   = 最暗
数值:100 = 最亮
人眼视角:40 - 76范围
****************************************************/
u16 Light_Get(void);
#endif

